tutorials/channel-transport/fluid-openfoam.template/case-template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       4280;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       4320;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4360;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       4410;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4470;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4400;
        startFace       4520;
    }
)

// ************************************************************************* //
