tutorials/channel-transport/fluid-openfoam.template/case-template/0/p.template
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    upperWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    obstacle
    {
        type            zeroGradient;
    }
    frontAndBottom
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}
