tutorials/channel-transport/fluid-openfoam.template/case-template/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
);